#summary the features supported by hustoj.
#labels Featured

= Introduction 简介 =

HUSTOJ is an GPL FreeSoftware.

HUSTOJ 是采用GPL的自由软件。


= Details =

  * 开源 全部采用开源技术，不仅仅是提供源代码，搭建[HUSTOJ]*不需要*购买任何商业软件。
  * 采用成熟的Linux32位系统平台，通过*目录锁定*和*用户锁定*以及*系统调用限制*避免恶意答案损害系统。
  * 支持负载均衡，可以将web服务器、数据库服务器、判题服务器分机架设，支持多台判题服务器同时工作。
  * 管理员可以完全通过web平台添加题目，包括测试数据也可以同时添加。
  * 加题界面采用fckeditor界面，支持从Word / 网页复制粘贴，支持各种格式，可以上传图片。
  * 提供源码查看支持C/C++/Java代码亮显。
  * 比赛可以快速复制，题目自动添加。
  * 题目、数据、标程，均可批量导出、导入，采用公开的基于XML的[FPS]格式，方便导入其他OJ系统，方便学校联赛交换题目。
  * 随系统提供百余道题目，导入就可以用于教学、比赛、测试。
  * 极低的系统需求，曾在C-600/128M/15G的老爷机上无故障运行一年，期间完成多次校赛。